
utfru = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я',\
         'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
calclang = ['#E560', '#E561', '#E562', '#E563', '#E564', '#E565', '#E566', '#E567', '#E568', '#E569', '#E56A', '#E56B', '#E56C', '#E56D', '#E56E', '#E56F', '#E570', '#E571',\
            '#E572', '#E573', '#E574', '#E575', '#E576', '#E577', '#E578', '#E579', '#E57A', '#E57B', '#E57C', '#E57D', '#E57E', '#E580', '#E581', '#E660', '#E661', '#E662',\
            '#E663', '#E664', '#E665', '#E666', '#E667', '#E668', '#E669', '#E66A', '#E66B', '#E66C', '#E66D', '#E66E', '#E66F', '#E670', '#E671', '#E672', '#E673', '#E674',\
            '#E675', '#E676', '#E677', '#E678', '#E679', '#E67A', '#E67B', '#E67C', '#E67D', '#E67E', '#E680', '#E681']
def convert(in_,out):
    instr = open(in_, encoding="utf8").read()
    outstr = instr
    for index in range(len(utfru) - 1):
        outstr = outstr.replace(utfru[index], calclang[index])
    with open(out, 'w', encoding="utf8") as txt:
        print(outstr, end='', file=txt)
in_ = "NOTDefined"
while in_ != "":
    in_ = input("From:")
    if in_ == "":
        break
    out = input("To:")
    convert(in_,out)
    print("Converted")
